zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz1038ca70100.h
/* ========== PIO definition for AFEC0 peripheral ========== */
#define PIN_PA8B_AFEC0_ADTRG                       (8L)         /**< AFEC0 signal: AFEC0_ADTRG on PA8 mux B*/
#define MUX_PA8B_AFEC0_ADTRG                       (1L)         /**< AFEC0 signal line function value: AFEC0_ADTRG */
#define PORT_PA8B_AFEC0_ADTRG                      (1UL << 8)
#define PIN_PD30X1_AFEC0_AD0                       (126L)       /**< AFEC0 signal: AFEC0_AD0 on PD30 mux X1*/
#define PORT_PD30X1_AFEC0_AD0                      (1UL << 30)
#define PIN_PA21X1_AFEC0_AD1                       (21L)        /**< AFEC0 signal: AFEC0_AD1 on PA21 mux X1*/
#define PORT_PA21X1_AFEC0_AD1                      (1UL << 21)
#define PIN_PB3X1_AFEC0_AD2                        (35L)        /**< AFEC0 signal: AFEC0_AD2 on PB3 mux X1*/
#define PORT_PB3X1_AFEC0_AD2                       (1UL << 3)
#define PIN_PB2X1_AFEC0_AD5                        (34L)        /**< AFEC0 signal: AFEC0_AD5 on PB2 mux X1*/
#define PORT_PB2X1_AFEC0_AD5                       (1UL << 2)
#define PIN_PA17X1_AFEC0_AD6                       (17L)        /**< AFEC0 signal: AFEC0_AD6 on PA17 mux X1*/
#define PORT_PA17X1_AFEC0_AD6                      (1UL << 17)
#define PIN_PA18X1_AFEC0_AD7                       (18L)        /**< AFEC0 signal: AFEC0_AD7 on PA18 mux X1*/
#define PORT_PA18X1_AFEC0_AD7                      (1UL << 18)
#define PIN_PA19X1_AFEC0_AD8                       (19L)        /**< AFEC0 signal: AFEC0_AD8 on PA19 mux X1*/
#define PORT_PA19X1_AFEC0_AD8                      (1UL << 19)
#define PIN_PA20X1_AFEC0_AD9                       (20L)        /**< AFEC0 signal: AFEC0_AD9 on PA20 mux X1*/
#define PORT_PA20X1_AFEC0_AD9                      (1UL << 20)
#define PIN_PB0X1_AFEC0_AD10                       (32L)        /**< AFEC0 signal: AFEC0_AD10 on PB0 mux X1*/
#define PORT_PB0X1_AFEC0_AD10                      (1UL << 0)
/* ========== PIO definition for AFEC1 peripheral ========== */
#define PIN_PD9C_AFEC1_ADTRG                       (105L)       /**< AFEC1 signal: AFEC1_ADTRG on PD9 mux C*/
#define MUX_PD9C_AFEC1_ADTRG                       (2L)         /**< AFEC1 signal line function value: AFEC1_ADTRG */
#define PORT_PD9C_AFEC1_ADTRG                      (1UL << 9)
#define PIN_PB1X1_AFEC1_AD0                        (33L)        /**< AFEC1 signal: AFEC1_AD0 on PB1 mux X1*/
#define PORT_PB1X1_AFEC1_AD0                       (1UL << 1)
/* ========== PIO definition for GMAC peripheral ========== */
#define PIN_PD13A_GMAC_GCOL                        (109L)       /**< GMAC signal: GCOL on PD13 mux A*/
#define MUX_PD13A_GMAC_GCOL                        (0L)         /**< GMAC signal line function value: GCOL */
#define PORT_PD13A_GMAC_GCOL                       (1UL << 13)
#define PIN_PD10A_GMAC_GCRS                        (106L)       /**< GMAC signal: GCRS on PD10 mux A*/
#define MUX_PD10A_GMAC_GCRS                        (0L)         /**< GMAC signal line function value: GCRS */
#define PORT_PD10A_GMAC_GCRS                       (1UL << 10)
#define PIN_PD8A_GMAC_GMDC                         (104L)       /**< GMAC signal: GMDC on PD8 mux A*/
#define MUX_PD8A_GMAC_GMDC                         (0L)         /**< GMAC signal line function value: GMDC */
#define PORT_PD8A_GMAC_GMDC                        (1UL << 8)
#define PIN_PD9A_GMAC_GMDIO                        (105L)       /**< GMAC signal: GMDIO on PD9 mux A*/
#define MUX_PD9A_GMAC_GMDIO                        (0L)         /**< GMAC signal line function value: GMDIO */
#define PORT_PD9A_GMAC_GMDIO                       (1UL << 9)
#define PIN_PD14A_GMAC_GRXCK                       (110L)       /**< GMAC signal: GRXCK on PD14 mux A*/
#define MUX_PD14A_GMAC_GRXCK                       (0L)         /**< GMAC signal line function value: GRXCK */
#define PORT_PD14A_GMAC_GRXCK                      (1UL << 14)
#define PIN_PD4A_GMAC_GRXDV                        (100L)       /**< GMAC signal: GRXDV on PD4 mux A*/
#define MUX_PD4A_GMAC_GRXDV                        (0L)         /**< GMAC signal line function value: GRXDV */
#define PORT_PD4A_GMAC_GRXDV                       (1UL << 4)
#define PIN_PD7A_GMAC_GRXER                        (103L)       /**< GMAC signal: GRXER on PD7 mux A*/
#define MUX_PD7A_GMAC_GRXER                        (0L)         /**< GMAC signal line function value: GRXER */
#define PORT_PD7A_GMAC_GRXER                       (1UL << 7)
#define PIN_PD5A_GMAC_GRX0                         (101L)       /**< GMAC signal: GRX0 on PD5 mux A*/
#define MUX_PD5A_GMAC_GRX0                         (0L)         /**< GMAC signal line function value: GRX0 */
#define PORT_PD5A_GMAC_GRX0                        (1UL << 5)
#define PIN_PD6A_GMAC_GRX1                         (102L)       /**< GMAC signal: GRX1 on PD6 mux A*/
#define MUX_PD6A_GMAC_GRX1                         (0L)         /**< GMAC signal line function value: GRX1 */
#define PORT_PD6A_GMAC_GRX1                        (1UL << 6)
#define PIN_PD11A_GMAC_GRX2                        (107L)       /**< GMAC signal: GRX2 on PD11 mux A*/
#define MUX_PD11A_GMAC_GRX2                        (0L)         /**< GMAC signal line function value: GRX2 */
#define PORT_PD11A_GMAC_GRX2                       (1UL << 11)
#define PIN_PD12A_GMAC_GRX3                        (108L)       /**< GMAC signal: GRX3 on PD12 mux A*/
#define MUX_PD12A_GMAC_GRX3                        (0L)         /**< GMAC signal line function value: GRX3 */
#define PORT_PD12A_GMAC_GRX3                       (1UL << 12)
#define PIN_PB1B_GMAC_GTSUCOMP                     (33L)        /**< GMAC signal: GTSUCOMP on PB1 mux B*/
#define MUX_PB1B_GMAC_GTSUCOMP                     (1L)         /**< GMAC signal line function value: GTSUCOMP */
#define PORT_PB1B_GMAC_GTSUCOMP                    (1UL << 1)
#define PIN_PB12B_GMAC_GTSUCOMP                    (44L)        /**< GMAC signal: GTSUCOMP on PB12 mux B*/
#define MUX_PB12B_GMAC_GTSUCOMP                    (1L)         /**< GMAC signal line function value: GTSUCOMP */
#define PORT_PB12B_GMAC_GTSUCOMP                   (1UL << 12)
#define PIN_PD11C_GMAC_GTSUCOMP                    (107L)       /**< GMAC signal: GTSUCOMP on PD11 mux C*/
#define MUX_PD11C_GMAC_GTSUCOMP                    (2L)         /**< GMAC signal line function value: GTSUCOMP */
#define PORT_PD11C_GMAC_GTSUCOMP                   (1UL << 11)
#define PIN_PD20C_GMAC_GTSUCOMP                    (116L)       /**< GMAC signal: GTSUCOMP on PD20 mux C*/
#define MUX_PD20C_GMAC_GTSUCOMP                    (2L)         /**< GMAC signal line function value: GTSUCOMP */
#define PORT_PD20C_GMAC_GTSUCOMP                   (1UL << 20)
#define PIN_PD0A_GMAC_GTXCK                        (96L)        /**< GMAC signal: GTXCK on PD0 mux A*/
#define MUX_PD0A_GMAC_GTXCK                        (0L)         /**< GMAC signal line function value: GTXCK */
#define PORT_PD0A_GMAC_GTXCK                       (1UL << 0)
#define PIN_PD1A_GMAC_GTXEN                        (97L)        /**< GMAC signal: GTXEN on PD1 mux A*/
#define MUX_PD1A_GMAC_GTXEN                        (0L)         /**< GMAC signal line function value: GTXEN */
#define PORT_PD1A_GMAC_GTXEN                       (1UL << 1)
#define PIN_PD17A_GMAC_GTXER                       (113L)       /**< GMAC signal: GTXER on PD17 mux A*/
#define MUX_PD17A_GMAC_GTXER                       (0L)         /**< GMAC signal line function value: GTXER */
#define PORT_PD17A_GMAC_GTXER                      (1UL << 17)
#define PIN_PD2A_GMAC_GTX0                         (98L)        /**< GMAC signal: GTX0 on PD2 mux A*/
#define MUX_PD2A_GMAC_GTX0                         (0L)         /**< GMAC signal line function value: GTX0 */
#define PORT_PD2A_GMAC_GTX0                        (1UL << 2)
#define PIN_PD3A_GMAC_GTX1                         (99L)        /**< GMAC signal: GTX1 on PD3 mux A*/
#define MUX_PD3A_GMAC_GTX1                         (0L)         /**< GMAC signal line function value: GTX1 */
#define PORT_PD3A_GMAC_GTX1                        (1UL << 3)
#define PIN_PD15A_GMAC_GTX2                        (111L)       /**< GMAC signal: GTX2 on PD15 mux A*/
#define MUX_PD15A_GMAC_GTX2                        (0L)         /**< GMAC signal line function value: GTX2 */
#define PORT_PD15A_GMAC_GTX2                       (1UL << 15)
#define PIN_PD16A_GMAC_GTX3                        (112L)       /**< GMAC signal: GTX3 on PD16 mux A*/
#define MUX_PD16A_GMAC_GTX3                        (0L)         /**< GMAC signal line function value: GTX3 */
#define PORT_PD16A_GMAC_GTX3                       (1UL << 16)
/* ========== PIO definition for HSMCI peripheral ========== */
#define PIN_PA28C_HSMCI_MCCDA                      (28L)        /**< HSMCI signal: MCCDA on PA28 mux C*/
#define MUX_PA28C_HSMCI_MCCDA                      (2L)         /**< HSMCI signal line function value: MCCDA */
#define PORT_PA28C_HSMCI_MCCDA                     (1UL << 28)
#define PIN_PA25D_HSMCI_MCCK                       (25L)        /**< HSMCI signal: MCCK on PA25 mux D*/
#define MUX_PA25D_HSMCI_MCCK                       (3L)         /**< HSMCI signal line function value: MCCK */
#define PORT_PA25D_HSMCI_MCCK                      (1UL << 25)
#define PIN_PA30C_HSMCI_MCDA0                      (30L)        /**< HSMCI signal: MCDA0 on PA30 mux C*/
#define MUX_PA30C_HSMCI_MCDA0                      (2L)         /**< HSMCI signal line function value: MCDA0 */
#define PORT_PA30C_HSMCI_MCDA0                     (1UL << 30)
#define PIN_PA31C_HSMCI_MCDA1                      (31L)        /**< HSMCI signal: MCDA1 on PA31 mux C*/
#define MUX_PA31C_HSMCI_MCDA1                      (2L)         /**< HSMCI signal line function value: MCDA1 */
#define PORT_PA31C_HSMCI_MCDA1                     (1UL << 31)
#define PIN_PA26C_HSMCI_MCDA2                      (26L)        /**< HSMCI signal: MCDA2 on PA26 mux C*/
#define MUX_PA26C_HSMCI_MCDA2                      (2L)         /**< HSMCI signal line function value: MCDA2 */
#define PORT_PA26C_HSMCI_MCDA2                     (1UL << 26)
#define PIN_PA27C_HSMCI_MCDA3                      (27L)        /**< HSMCI signal: MCDA3 on PA27 mux C*/
#define MUX_PA27C_HSMCI_MCDA3                      (2L)         /**< HSMCI signal line function value: MCDA3 */
#define PORT_PA27C_HSMCI_MCDA3                     (1UL << 27)
/* ========== PIO definition for I2SC0 peripheral ========== */
#define PIN_PA1D_I2SC0_CK                          (1L)         /**< I2SC0 signal: I2SC0_CK on PA1 mux D*/
#define MUX_PA1D_I2SC0_CK                          (3L)         /**< I2SC0 signal line function value: I2SC0_CK */
#define PORT_PA1D_I2SC0_CK                         (1UL << 1)
#define PIN_PA16D_I2SC0_DI                         (16L)        /**< I2SC0 signal: I2SC0_DI on PA16 mux D*/
#define MUX_PA16D_I2SC0_DI                         (3L)         /**< I2SC0 signal line function value: I2SC0_DI */
#define PORT_PA16D_I2SC0_DI                        (1UL << 16)
#define PIN_PA30D_I2SC0_DO                         (30L)        /**< I2SC0 signal: I2SC0_DO on PA30 mux D*/
#define MUX_PA30D_I2SC0_DO                         (3L)         /**< I2SC0 signal line function value: I2SC0_DO */
#define PORT_PA30D_I2SC0_DO                        (1UL << 30)
#define PIN_PA0D_I2SC0_MCK                         (0L)         /**< I2SC0 signal: I2SC0_MCK on PA0 mux D*/
#define MUX_PA0D_I2SC0_MCK                         (3L)         /**< I2SC0 signal line function value: I2SC0_MCK */
#define PORT_PA0D_I2SC0_MCK                        (1UL << 0)
#define PIN_PA15D_I2SC0_WS                         (15L)        /**< I2SC0 signal: I2SC0_WS on PA15 mux D*/
#define MUX_PA15D_I2SC0_WS                         (3L)         /**< I2SC0 signal line function value: I2SC0_WS */
#define PORT_PA15D_I2SC0_WS                        (1UL << 15)
/* ========== PIO definition for I2SC1 peripheral ========== */
#define PIN_PA20D_I2SC1_CK                         (20L)        /**< I2SC1 signal: I2SC1_CK on PA20 mux D*/
#define MUX_PA20D_I2SC1_CK                         (3L)         /**< I2SC1 signal line function value: I2SC1_CK */
#define PORT_PA20D_I2SC1_CK                        (1UL << 20)
#define PIN_PA19D_I2SC1_MCK                        (19L)        /**< I2SC1 signal: I2SC1_MCK on PA19 mux D*/
#define MUX_PA19D_I2SC1_MCK                        (3L)         /**< I2SC1 signal line function value: I2SC1_MCK */
#define PORT_PA19D_I2SC1_MCK                       (1UL << 19)
/* ========== PIO definition for ISI peripheral ========== */
#define PIN_PD22D_ISI_D0                           (118L)       /**< ISI signal: ISI_D0 on PD22 mux D*/
#define MUX_PD22D_ISI_D0                           (3L)         /**< ISI signal line function value: ISI_D0 */
#define PORT_PD22D_ISI_D0                          (1UL << 22)
#define PIN_PD21D_ISI_D1                           (117L)       /**< ISI signal: ISI_D1 on PD21 mux D*/
#define MUX_PD21D_ISI_D1                           (3L)         /**< ISI signal line function value: ISI_D1 */
#define PORT_PD21D_ISI_D1                          (1UL << 21)
#define PIN_PB3D_ISI_D2                            (35L)        /**< ISI signal: ISI_D2 on PB3 mux D*/
#define MUX_PB3D_ISI_D2                            (3L)         /**< ISI signal line function value: ISI_D2 */
#define PORT_PB3D_ISI_D2                           (1UL << 3)
#define PIN_PA9B_ISI_D3                            (9L)         /**< ISI signal: ISI_D3 on PA9 mux B*/
#define MUX_PA9B_ISI_D3                            (1L)         /**< ISI signal line function value: ISI_D3 */
#define PORT_PA9B_ISI_D3                           (1UL << 9)
#define PIN_PA5B_ISI_D4                            (5L)         /**< ISI signal: ISI_D4 on PA5 mux B*/
#define MUX_PA5B_ISI_D4                            (1L)         /**< ISI signal line function value: ISI_D4 */
#define PORT_PA5B_ISI_D4                           (1UL << 5)
#define PIN_PD11D_ISI_D5                           (107L)       /**< ISI signal: ISI_D5 on PD11 mux D*/
#define MUX_PD11D_ISI_D5                           (3L)         /**< ISI signal line function value: ISI_D5 */
#define PORT_PD11D_ISI_D5                          (1UL << 11)
#define PIN_PD12D_ISI_D6                           (108L)       /**< ISI signal: ISI_D6 on PD12 mux D*/
#define MUX_PD12D_ISI_D6                           (3L)         /**< ISI signal line function value: ISI_D6 */
#define PORT_PD12D_ISI_D6                          (1UL << 12)
#define PIN_PA27D_ISI_D7                           (27L)        /**< ISI signal: ISI_D7 on PA27 mux D*/
#define MUX_PA27D_ISI_D7                           (3L)         /**< ISI signal line function value: ISI_D7 */
#define PORT_PA27D_ISI_D7                          (1UL << 27)
#define PIN_PD27D_ISI_D8                           (123L)       /**< ISI signal: ISI_D8 on PD27 mux D*/
#define MUX_PD27D_ISI_D8                           (3L)         /**< ISI signal line function value: ISI_D8 */
#define PORT_PD27D_ISI_D8                          (1UL << 27)
#define PIN_PD28D_ISI_D9                           (124L)       /**< ISI signal: ISI_D9 on PD28 mux D*/
#define MUX_PD28D_ISI_D9                           (3L)         /**< ISI signal line function value: ISI_D9 */
#define PORT_PD28D_ISI_D9                          (1UL << 28)
#define PIN_PD30D_ISI_D10                          (126L)       /**< ISI signal: ISI_D10 on PD30 mux D*/
#define MUX_PD30D_ISI_D10                          (3L)         /**< ISI signal line function value: ISI_D10 */
#define PORT_PD30D_ISI_D10                         (1UL << 30)
#define PIN_PD31D_ISI_D11                          (127L)       /**< ISI signal: ISI_D11 on PD31 mux D*/
#define MUX_PD31D_ISI_D11                          (3L)         /**< ISI signal line function value: ISI_D11 */
#define PORT_PD31D_ISI_D11                         (1UL << 31)
#define PIN_PD24D_ISI_HSYNC                        (120L)       /**< ISI signal: ISI_HSYNC on PD24 mux D*/
#define MUX_PD24D_ISI_HSYNC                        (3L)         /**< ISI signal line function value: ISI_HSYNC */
#define PORT_PD24D_ISI_HSYNC                       (1UL << 24)
#define PIN_PA24D_ISI_PCK                          (24L)        /**< ISI signal: ISI_PCK on PA24 mux D*/
#define MUX_PA24D_ISI_PCK                          (3L)         /**< ISI signal line function value: ISI_PCK */
#define PORT_PA24D_ISI_PCK                         (1UL << 24)
#define PIN_PD25D_ISI_VSYNC                        (121L)       /**< ISI signal: ISI_VSYNC on PD25 mux D*/
#define MUX_PD25D_ISI_VSYNC                        (3L)         /**< ISI signal line function value: ISI_VSYNC */
#define PORT_PD25D_ISI_VSYNC                       (1UL << 25)
/* ========== PIO definition for MCAN0 peripheral ========== */
#define PIN_PB3A_MCAN0_CANRX0                      (35L)        /**< MCAN0 signal: CANRX0 on PB3 mux A*/
#define MUX_PB3A_MCAN0_CANRX0                      (0L)         /**< MCAN0 signal line function value: CANRX0 */
#define PORT_PB3A_MCAN0_CANRX0                     (1UL << 3)
#define PIN_PB2A_MCAN0_CANTX0                      (34L)        /**< MCAN0 signal: CANTX0 on PB2 mux A*/
#define MUX_PB2A_MCAN0_CANTX0                      (0L)         /**< MCAN0 signal line function value: CANTX0 */
#define PORT_PB2A_MCAN0_CANTX0                     (1UL << 2)
/* ========== PIO definition for MCAN1 peripheral ========== */
#define PIN_PD28B_MCAN1_CANRX1                     (124L)       /**< MCAN1 signal: CANRX1 on PD28 mux B*/
#define MUX_PD28B_MCAN1_CANRX1                     (1L)         /**< MCAN1 signal line function value: CANRX1 */
#define PORT_PD28B_MCAN1_CANRX1                    (1UL << 28)
#define PIN_PD12B_MCAN1_CANTX1                     (108L)       /**< MCAN1 signal: CANTX1 on PD12 mux B*/
#define MUX_PD12B_MCAN1_CANTX1                     (1L)         /**< MCAN1 signal line function value: CANTX1 */
#define PORT_PD12B_MCAN1_CANTX1                    (1UL << 12)
/* ========== PIO definition for MLB peripheral ========== */
#define PIN_PB4C_MLB_MLBCLK                        (36L)        /**< MLB signal: MLBCLK on PB4 mux C*/
#define MUX_PB4C_MLB_MLBCLK                        (2L)         /**< MLB signal line function value: MLBCLK */
#define PORT_PB4C_MLB_MLBCLK                       (1UL << 4)
#define PIN_PB5C_MLB_MLBDAT                        (37L)        /**< MLB signal: MLBDAT on PB5 mux C*/
#define MUX_PB5C_MLB_MLBDAT                        (2L)         /**< MLB signal line function value: MLBDAT */
#define PORT_PB5C_MLB_MLBDAT                       (1UL << 5)
#define PIN_PD10D_MLB_MLBSIG                       (106L)       /**< MLB signal: MLBSIG on PD10 mux D*/
#define MUX_PD10D_MLB_MLBSIG                       (3L)         /**< MLB signal line function value: MLBSIG */
#define PORT_PD10D_MLB_MLBSIG                      (1UL << 10)
/* ========== PIO definition for PMC peripheral ========== */
#define PIN_PA6B_PMC_PCK0                          (6L)         /**< PMC signal: PCK0 on PA6 mux B*/
#define MUX_PA6B_PMC_PCK0                          (1L)         /**< PMC signal line function value: PCK0 */
#define PORT_PA6B_PMC_PCK0                         (1UL << 6)
#define PIN_PB12D_PMC_PCK0                         (44L)        /**< PMC signal: PCK0 on PB12 mux D*/
#define MUX_PB12D_PMC_PCK0                         (3L)         /**< PMC signal line function value: PCK0 */
#define PORT_PB12D_PMC_PCK0                        (1UL << 12)
#define PIN_PB13B_PMC_PCK0                         (45L)        /**< PMC signal: PCK0 on PB13 mux B*/
#define MUX_PB13B_PMC_PCK0                         (1L)         /**< PMC signal line function value: PCK0 */
#define PORT_PB13B_PMC_PCK0                        (1UL << 13)
#define PIN_PA17B_PMC_PCK1                         (17L)        /**< PMC signal: PCK1 on PA17 mux B*/
#define MUX_PA17B_PMC_PCK1                         (1L)         /**< PMC signal line function value: PCK1 */
#define PORT_PA17B_PMC_PCK1                        (1UL << 17)
#define PIN_PA21B_PMC_PCK1                         (21L)        /**< PMC signal: PCK1 on PA21 mux B*/
#define MUX_PA21B_PMC_PCK1                         (1L)         /**< PMC signal line function value: PCK1 */
#define PORT_PA21B_PMC_PCK1                        (1UL << 21)
#define PIN_PA3C_PMC_PCK2                          (3L)         /**< PMC signal: PCK2 on PA3 mux C*/
#define MUX_PA3C_PMC_PCK2                          (2L)         /**< PMC signal line function value: PCK2 */
#define PORT_PA3C_PMC_PCK2                         (1UL << 3)
#define PIN_PA18B_PMC_PCK2                         (18L)        /**< PMC signal: PCK2 on PA18 mux B*/
#define MUX_PA18B_PMC_PCK2                         (1L)         /**< PMC signal line function value: PCK2 */
#define PORT_PA18B_PMC_PCK2                        (1UL << 18)
#define PIN_PA31B_PMC_PCK2                         (31L)        /**< PMC signal: PCK2 on PA31 mux B*/
#define MUX_PA31B_PMC_PCK2                         (1L)         /**< PMC signal line function value: PCK2 */
#define PORT_PA31B_PMC_PCK2                        (1UL << 31)
#define PIN_PB3B_PMC_PCK2                          (35L)        /**< PMC signal: PCK2 on PB3 mux B*/
#define MUX_PB3B_PMC_PCK2                          (1L)         /**< PMC signal line function value: PCK2 */
#define PORT_PB3B_PMC_PCK2                         (1UL << 3)
#define PIN_PD31C_PMC_PCK2                         (127L)       /**< PMC signal: PCK2 on PD31 mux C*/
#define MUX_PD31C_PMC_PCK2                         (2L)         /**< PMC signal line function value: PCK2 */
#define PORT_PD31C_PMC_PCK2                        (1UL << 31)
/* ========== PIO definition for PWMC0 peripheral ========== */
#define PIN_PA10B_PWMC0_PWMEXTRG0                  (10L)        /**< PWMC0 signal: PWMC0_PWMEXTRG0 on PA10 mux B*/
#define MUX_PA10B_PWMC0_PWMEXTRG0                  (1L)         /**< PWMC0 signal line function value: PWMC0_PWMEXTRG0 */
#define PORT_PA10B_PWMC0_PWMEXTRG0                 (1UL << 10)
#define PIN_PA22B_PWMC0_PWMEXTRG1                  (22L)        /**< PWMC0 signal: PWMC0_PWMEXTRG1 on PA22 mux B*/
#define MUX_PA22B_PWMC0_PWMEXTRG1                  (1L)         /**< PWMC0 signal line function value: PWMC0_PWMEXTRG1 */
#define PORT_PA22B_PWMC0_PWMEXTRG1                 (1UL << 22)
#define PIN_PA9C_PWMC0_PWMFI0                      (9L)         /**< PWMC0 signal: PWMC0_PWMFI0 on PA9 mux C*/
#define MUX_PA9C_PWMC0_PWMFI0                      (2L)         /**< PWMC0 signal line function value: PWMC0_PWMFI0 */
#define PORT_PA9C_PWMC0_PWMFI0                     (1UL << 9)
#define PIN_PD8B_PWMC0_PWMFI1                      (104L)       /**< PWMC0 signal: PWMC0_PWMFI1 on PD8 mux B*/
#define MUX_PD8B_PWMC0_PWMFI1                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMFI1 */
#define PORT_PD8B_PWMC0_PWMFI1                     (1UL << 8)
#define PIN_PD9B_PWMC0_PWMFI2                      (105L)       /**< PWMC0 signal: PWMC0_PWMFI2 on PD9 mux B*/
#define MUX_PD9B_PWMC0_PWMFI2                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMFI2 */
#define PORT_PD9B_PWMC0_PWMFI2                     (1UL << 9)
#define PIN_PA0A_PWMC0_PWMH0                       (0L)         /**< PWMC0 signal: PWMC0_PWMH0 on PA0 mux A*/
#define MUX_PA0A_PWMC0_PWMH0                       (0L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
#define PORT_PA0A_PWMC0_PWMH0                      (1UL << 0)
#define PIN_PA11B_PWMC0_PWMH0                      (11L)        /**< PWMC0 signal: PWMC0_PWMH0 on PA11 mux B*/
#define MUX_PA11B_PWMC0_PWMH0                      (1L)         /**< PWMC0 signal line function value: PWMC0_PWMH0 */
