zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/pio/pic32cz1038ca70100.h
#define PORT_PA29B_TC0_TCLK2                       (1UL << 29)
#define PIN_PA0B_TC0_TIOA0                         (0L)         /**< TC0 signal: TIOA0 on PA0 mux B*/
#define MUX_PA0B_TC0_TIOA0                         (1L)         /**< TC0 signal line function value: TIOA0 */
#define PORT_PA0B_TC0_TIOA0                        (1UL << 0)
#define PIN_PA15B_TC0_TIOA1                        (15L)        /**< TC0 signal: TIOA1 on PA15 mux B*/
#define MUX_PA15B_TC0_TIOA1                        (1L)         /**< TC0 signal line function value: TIOA1 */
#define PORT_PA15B_TC0_TIOA1                       (1UL << 15)
#define PIN_PA26B_TC0_TIOA2                        (26L)        /**< TC0 signal: TIOA2 on PA26 mux B*/
#define MUX_PA26B_TC0_TIOA2                        (1L)         /**< TC0 signal line function value: TIOA2 */
#define PORT_PA26B_TC0_TIOA2                       (1UL << 26)
#define PIN_PA1B_TC0_TIOB0                         (1L)         /**< TC0 signal: TIOB0 on PA1 mux B*/
#define MUX_PA1B_TC0_TIOB0                         (1L)         /**< TC0 signal line function value: TIOB0 */
#define PORT_PA1B_TC0_TIOB0                        (1UL << 1)
#define PIN_PA16B_TC0_TIOB1                        (16L)        /**< TC0 signal: TIOB1 on PA16 mux B*/
#define MUX_PA16B_TC0_TIOB1                        (1L)         /**< TC0 signal line function value: TIOB1 */
#define PORT_PA16B_TC0_TIOB1                       (1UL << 16)
#define PIN_PA27B_TC0_TIOB2                        (27L)        /**< TC0 signal: TIOB2 on PA27 mux B*/
#define MUX_PA27B_TC0_TIOB2                        (1L)         /**< TC0 signal line function value: TIOB2 */
#define PORT_PA27B_TC0_TIOB2                       (1UL << 27)
/* ========== PIO definition for TC3 peripheral ========== */
#define PIN_PD24C_TC3_TCLK11                       (120L)       /**< TC3 signal: TCLK11 on PD24 mux C*/
#define MUX_PD24C_TC3_TCLK11                       (2L)         /**< TC3 signal line function value: TCLK11 */
#define PORT_PD24C_TC3_TCLK11                      (1UL << 24)
#define PIN_PD21C_TC3_TIOA11                       (117L)       /**< TC3 signal: TIOA11 on PD21 mux C*/
#define MUX_PD21C_TC3_TIOA11                       (2L)         /**< TC3 signal line function value: TIOA11 */
#define PORT_PD21C_TC3_TIOA11                      (1UL << 21)
#define PIN_PD22C_TC3_TIOB11                       (118L)       /**< TC3 signal: TIOB11 on PD22 mux C*/
#define MUX_PD22C_TC3_TIOB11                       (2L)         /**< TC3 signal line function value: TIOB11 */
#define PORT_PD22C_TC3_TIOB11                      (1UL << 22)
/* ========== PIO definition for TWI0 peripheral ========== */
#define PIN_PA4A_TWI0_TWCK0                        (4L)         /**< TWI0 signal: TWCK0 on PA4 mux A*/
#define MUX_PA4A_TWI0_TWCK0                        (0L)         /**< TWI0 signal line function value: TWCK0 */
#define PORT_PA4A_TWI0_TWCK0                       (1UL << 4)
#define PIN_PA3A_TWI0_TWD0                         (3L)         /**< TWI0 signal: TWD0 on PA3 mux A*/
#define MUX_PA3A_TWI0_TWD0                         (0L)         /**< TWI0 signal line function value: TWD0 */
#define PORT_PA3A_TWI0_TWD0                        (1UL << 3)
/* ========== PIO definition for TWI1 peripheral ========== */
#define PIN_PB5A_TWI1_TWCK1                        (37L)        /**< TWI1 signal: TWCK1 on PB5 mux A*/
#define MUX_PB5A_TWI1_TWCK1                        (0L)         /**< TWI1 signal line function value: TWCK1 */
#define PORT_PB5A_TWI1_TWCK1                       (1UL << 5)
#define PIN_PB4A_TWI1_TWD1                         (36L)        /**< TWI1 signal: TWD1 on PB4 mux A*/
#define MUX_PB4A_TWI1_TWD1                         (0L)         /**< TWI1 signal line function value: TWD1 */
#define PORT_PB4A_TWI1_TWD1                        (1UL << 4)
/* ========== PIO definition for TWI2 peripheral ========== */
#define PIN_PD28C_TWI2_TWCK2                       (124L)       /**< TWI2 signal: TWCK2 on PD28 mux C*/
#define MUX_PD28C_TWI2_TWCK2                       (2L)         /**< TWI2 signal line function value: TWCK2 */
#define PORT_PD28C_TWI2_TWCK2                      (1UL << 28)
#define PIN_PD27C_TWI2_TWD2                        (123L)       /**< TWI2 signal: TWD2 on PD27 mux C*/
#define MUX_PD27C_TWI2_TWD2                        (2L)         /**< TWI2 signal line function value: TWD2 */
#define PORT_PD27C_TWI2_TWD2                       (1UL << 27)
/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_PA9A_UART0_URXD0                       (9L)         /**< UART0 signal: URXD0 on PA9 mux A*/
#define MUX_PA9A_UART0_URXD0                       (0L)         /**< UART0 signal line function value: URXD0 */
#define PORT_PA9A_UART0_URXD0                      (1UL << 9)
#define PIN_PA10A_UART0_UTXD0                      (10L)        /**< UART0 signal: UTXD0 on PA10 mux A*/
#define MUX_PA10A_UART0_UTXD0                      (0L)         /**< UART0 signal line function value: UTXD0 */
#define PORT_PA10A_UART0_UTXD0                     (1UL << 10)
/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_PA5C_UART1_URXD1                       (5L)         /**< UART1 signal: URXD1 on PA5 mux C*/
#define MUX_PA5C_UART1_URXD1                       (2L)         /**< UART1 signal line function value: URXD1 */
#define PORT_PA5C_UART1_URXD1                      (1UL << 5)
#define PIN_PA4C_UART1_UTXD1                       (4L)         /**< UART1 signal: UTXD1 on PA4 mux C*/
#define MUX_PA4C_UART1_UTXD1                       (2L)         /**< UART1 signal line function value: UTXD1 */
#define PORT_PA4C_UART1_UTXD1                      (1UL << 4)
#define PIN_PA6C_UART1_UTXD1                       (6L)         /**< UART1 signal: UTXD1 on PA6 mux C*/
#define MUX_PA6C_UART1_UTXD1                       (2L)         /**< UART1 signal line function value: UTXD1 */
#define PORT_PA6C_UART1_UTXD1                      (1UL << 6)
#define PIN_PD26D_UART1_UTXD1                      (122L)       /**< UART1 signal: UTXD1 on PD26 mux D*/
#define MUX_PD26D_UART1_UTXD1                      (3L)         /**< UART1 signal line function value: UTXD1 */
#define PORT_PD26D_UART1_UTXD1                     (1UL << 26)
/* ========== PIO definition for UART2 peripheral ========== */
#define PIN_PD25C_UART2_URXD2                      (121L)       /**< UART2 signal: URXD2 on PD25 mux C*/
#define MUX_PD25C_UART2_URXD2                      (2L)         /**< UART2 signal line function value: URXD2 */
#define PORT_PD25C_UART2_URXD2                     (1UL << 25)
#define PIN_PD26C_UART2_UTXD2                      (122L)       /**< UART2 signal: UTXD2 on PD26 mux C*/
#define MUX_PD26C_UART2_UTXD2                      (2L)         /**< UART2 signal line function value: UTXD2 */
#define PORT_PD26C_UART2_UTXD2                     (1UL << 26)
/* ========== PIO definition for UART3 peripheral ========== */
#define PIN_PD28A_UART3_URXD3                      (124L)       /**< UART3 signal: URXD3 on PD28 mux A*/
#define MUX_PD28A_UART3_URXD3                      (0L)         /**< UART3 signal line function value: URXD3 */
#define PORT_PD28A_UART3_URXD3                     (1UL << 28)
#define PIN_PD30A_UART3_UTXD3                      (126L)       /**< UART3 signal: UTXD3 on PD30 mux A*/
#define MUX_PD30A_UART3_UTXD3                      (0L)         /**< UART3 signal line function value: UTXD3 */
#define PORT_PD30A_UART3_UTXD3                     (1UL << 30)
#define PIN_PD31B_UART3_UTXD3                      (127L)       /**< UART3 signal: UTXD3 on PD31 mux B*/
#define MUX_PD31B_UART3_UTXD3                      (1L)         /**< UART3 signal line function value: UTXD3 */
#define PORT_PD31B_UART3_UTXD3                     (1UL << 31)
/* ========== PIO definition for UART4 peripheral ========== */
#define PIN_PD18C_UART4_URXD4                      (114L)       /**< UART4 signal: URXD4 on PD18 mux C*/
#define MUX_PD18C_UART4_URXD4                      (2L)         /**< UART4 signal line function value: URXD4 */
#define PORT_PD18C_UART4_URXD4                     (1UL << 18)
#define PIN_PD3C_UART4_UTXD4                       (99L)        /**< UART4 signal: UTXD4 on PD3 mux C*/
#define MUX_PD3C_UART4_UTXD4                       (2L)         /**< UART4 signal line function value: UTXD4 */
#define PORT_PD3C_UART4_UTXD4                      (1UL << 3)
#define PIN_PD19C_UART4_UTXD4                      (115L)       /**< UART4 signal: UTXD4 on PD19 mux C*/
#define MUX_PD19C_UART4_UTXD4                      (2L)         /**< UART4 signal line function value: UTXD4 */
#define PORT_PD19C_UART4_UTXD4                     (1UL << 19)
/* ========== PIO definition for USART0 peripheral ========== */
#define PIN_PB2C_USART0_CTS0                       (34L)        /**< USART0 signal: CTS0 on PB2 mux C*/
#define MUX_PB2C_USART0_CTS0                       (2L)         /**< USART0 signal line function value: CTS0 */
#define PORT_PB2C_USART0_CTS0                      (1UL << 2)
#define PIN_PD0D_USART0_DCD0                       (96L)        /**< USART0 signal: DCD0 on PD0 mux D*/
#define MUX_PD0D_USART0_DCD0                       (3L)         /**< USART0 signal line function value: DCD0 */
#define PORT_PD0D_USART0_DCD0                      (1UL << 0)
#define PIN_PD2D_USART0_DSR0                       (98L)        /**< USART0 signal: DSR0 on PD2 mux D*/
#define MUX_PD2D_USART0_DSR0                       (3L)         /**< USART0 signal line function value: DSR0 */
#define PORT_PD2D_USART0_DSR0                      (1UL << 2)
#define PIN_PD1D_USART0_DTR0                       (97L)        /**< USART0 signal: DTR0 on PD1 mux D*/
#define MUX_PD1D_USART0_DTR0                       (3L)         /**< USART0 signal line function value: DTR0 */
#define PORT_PD1D_USART0_DTR0                      (1UL << 1)
#define PIN_PD3D_USART0_RI0                        (99L)        /**< USART0 signal: RI0 on PD3 mux D*/
#define MUX_PD3D_USART0_RI0                        (3L)         /**< USART0 signal line function value: RI0 */
#define PORT_PD3D_USART0_RI0                       (1UL << 3)
#define PIN_PB3C_USART0_RTS0                       (35L)        /**< USART0 signal: RTS0 on PB3 mux C*/
#define MUX_PB3C_USART0_RTS0                       (2L)         /**< USART0 signal line function value: RTS0 */
#define PORT_PB3C_USART0_RTS0                      (1UL << 3)
#define PIN_PB0C_USART0_RXD0                       (32L)        /**< USART0 signal: RXD0 on PB0 mux C*/
#define MUX_PB0C_USART0_RXD0                       (2L)         /**< USART0 signal line function value: RXD0 */
#define PORT_PB0C_USART0_RXD0                      (1UL << 0)
#define PIN_PB13C_USART0_SCK0                      (45L)        /**< USART0 signal: SCK0 on PB13 mux C*/
#define MUX_PB13C_USART0_SCK0                      (2L)         /**< USART0 signal line function value: SCK0 */
#define PORT_PB13C_USART0_SCK0                     (1UL << 13)
#define PIN_PB1C_USART0_TXD0                       (33L)        /**< USART0 signal: TXD0 on PB1 mux C*/
#define MUX_PB1C_USART0_TXD0                       (2L)         /**< USART0 signal line function value: TXD0 */
#define PORT_PB1C_USART0_TXD0                      (1UL << 1)
/* ========== PIO definition for USART1 peripheral ========== */
#define PIN_PA25A_USART1_CTS1                      (25L)        /**< USART1 signal: CTS1 on PA25 mux A*/
#define MUX_PA25A_USART1_CTS1                      (0L)         /**< USART1 signal line function value: CTS1 */
#define PORT_PA25A_USART1_CTS1                     (1UL << 25)
#define PIN_PA26A_USART1_DCD1                      (26L)        /**< USART1 signal: DCD1 on PA26 mux A*/
#define MUX_PA26A_USART1_DCD1                      (0L)         /**< USART1 signal line function value: DCD1 */
#define PORT_PA26A_USART1_DCD1                     (1UL << 26)
#define PIN_PA28A_USART1_DSR1                      (28L)        /**< USART1 signal: DSR1 on PA28 mux A*/
#define MUX_PA28A_USART1_DSR1                      (0L)         /**< USART1 signal line function value: DSR1 */
#define PORT_PA28A_USART1_DSR1                     (1UL << 28)
#define PIN_PA27A_USART1_DTR1                      (27L)        /**< USART1 signal: DTR1 on PA27 mux A*/
#define MUX_PA27A_USART1_DTR1                      (0L)         /**< USART1 signal line function value: DTR1 */
#define PORT_PA27A_USART1_DTR1                     (1UL << 27)
#define PIN_PA3B_USART1_LONCOL1                    (3L)         /**< USART1 signal: LONCOL1 on PA3 mux B*/
#define MUX_PA3B_USART1_LONCOL1                    (1L)         /**< USART1 signal line function value: LONCOL1 */
#define PORT_PA3B_USART1_LONCOL1                   (1UL << 3)
#define PIN_PA29A_USART1_RI1                       (29L)        /**< USART1 signal: RI1 on PA29 mux A*/
#define MUX_PA29A_USART1_RI1                       (0L)         /**< USART1 signal line function value: RI1 */
#define PORT_PA29A_USART1_RI1                      (1UL << 29)
#define PIN_PA24A_USART1_RTS1                      (24L)        /**< USART1 signal: RTS1 on PA24 mux A*/
#define MUX_PA24A_USART1_RTS1                      (0L)         /**< USART1 signal line function value: RTS1 */
#define PORT_PA24A_USART1_RTS1                     (1UL << 24)
#define PIN_PA21A_USART1_RXD1                      (21L)        /**< USART1 signal: RXD1 on PA21 mux A*/
#define MUX_PA21A_USART1_RXD1                      (0L)         /**< USART1 signal line function value: RXD1 */
#define PORT_PA21A_USART1_RXD1                     (1UL << 21)
#define PIN_PA23A_USART1_SCK1                      (23L)        /**< USART1 signal: SCK1 on PA23 mux A*/
#define MUX_PA23A_USART1_SCK1                      (0L)         /**< USART1 signal line function value: SCK1 */
#define PORT_PA23A_USART1_SCK1                     (1UL << 23)
#define PIN_PB4D_USART1_TXD1                       (36L)        /**< USART1 signal: TXD1 on PB4 mux D*/
#define MUX_PB4D_USART1_TXD1                       (3L)         /**< USART1 signal line function value: TXD1 */
#define PORT_PB4D_USART1_TXD1                      (1UL << 4)
/* ========== PIO definition for USART2 peripheral ========== */
#define PIN_PD19B_USART2_CTS2                      (115L)       /**< USART2 signal: CTS2 on PD19 mux B*/
#define MUX_PD19B_USART2_CTS2                      (1L)         /**< USART2 signal line function value: CTS2 */
#define PORT_PD19B_USART2_CTS2                     (1UL << 19)
#define PIN_PD4D_USART2_DCD2                       (100L)       /**< USART2 signal: DCD2 on PD4 mux D*/
#define MUX_PD4D_USART2_DCD2                       (3L)         /**< USART2 signal line function value: DCD2 */
#define PORT_PD4D_USART2_DCD2                      (1UL << 4)
#define PIN_PD6D_USART2_DSR2                       (102L)       /**< USART2 signal: DSR2 on PD6 mux D*/
#define MUX_PD6D_USART2_DSR2                       (3L)         /**< USART2 signal line function value: DSR2 */
#define PORT_PD6D_USART2_DSR2                      (1UL << 6)
#define PIN_PD5D_USART2_DTR2                       (101L)       /**< USART2 signal: DTR2 on PD5 mux D*/
#define MUX_PD5D_USART2_DTR2                       (3L)         /**< USART2 signal line function value: DTR2 */
#define PORT_PD5D_USART2_DTR2                      (1UL << 5)
#define PIN_PD7D_USART2_RI2                        (103L)       /**< USART2 signal: RI2 on PD7 mux D*/
#define MUX_PD7D_USART2_RI2                        (3L)         /**< USART2 signal line function value: RI2 */
#define PORT_PD7D_USART2_RI2                       (1UL << 7)
#define PIN_PD18B_USART2_RTS2                      (114L)       /**< USART2 signal: RTS2 on PD18 mux B*/
#define MUX_PD18B_USART2_RTS2                      (1L)         /**< USART2 signal line function value: RTS2 */
#define PORT_PD18B_USART2_RTS2                     (1UL << 18)
#define PIN_PD15B_USART2_RXD2                      (111L)       /**< USART2 signal: RXD2 on PD15 mux B*/
#define MUX_PD15B_USART2_RXD2                      (1L)         /**< USART2 signal line function value: RXD2 */
#define PORT_PD15B_USART2_RXD2                     (1UL << 15)
#define PIN_PD17B_USART2_SCK2                      (113L)       /**< USART2 signal: SCK2 on PD17 mux B*/
#define MUX_PD17B_USART2_SCK2                      (1L)         /**< USART2 signal line function value: SCK2 */
#define PORT_PD17B_USART2_SCK2                     (1UL << 17)
#define PIN_PD16B_USART2_TXD2                      (112L)       /**< USART2 signal: TXD2 on PD16 mux B*/
#define MUX_PD16B_USART2_TXD2                      (1L)         /**< USART2 signal line function value: TXD2 */
#define PORT_PD16B_USART2_TXD2                     (1UL << 16)
/* ========== PIO definition for OSCILLATOR peripheral ========== */
#define PIN_PB9X1_OSCILLATOR_XIN                   (41L)        /**< OSCILLATOR signal: XIN on PB9 mux X1*/
#define PORT_PB9X1_OSCILLATOR_XIN                  (1UL << 9)
#define PIN_PB8X1_OSCILLATOR_XOUT                  (40L)        /**< OSCILLATOR signal: XOUT on PB8 mux X1*/
#define PORT_PB8X1_OSCILLATOR_XOUT                 (1UL << 8)
#define PIN_PA7X1_OSCILLATOR_XIN32                 (7L)         /**< OSCILLATOR signal: XIN32 on PA7 mux X1*/
#define PORT_PA7X1_OSCILLATOR_XIN32                (1UL << 7)
#define PIN_PA8X1_OSCILLATOR_XOUT32                (8L)         /**< OSCILLATOR signal: XOUT32 on PA8 mux X1*/
#define PORT_PA8X1_OSCILLATOR_XOUT32               (1UL << 8)
/* ========== PIO definition for PORT peripheral ========== */
#define PIN_PA3X1_PORT_PORTDC0                     (3L)         /**< PORT signal: PORTDC0 on PA3 mux X1*/
#define PORT_PA3X1_PORT_PORTDC0                    (1UL << 3)
#define PIN_PA4X1_PORT_PORTDC1                     (4L)         /**< PORT signal: PORTDC1 on PA4 mux X1*/
#define PORT_PA4X1_PORT_PORTDC1                    (1UL << 4)
#define PIN_PA5X1_PORT_PORTDC2                     (5L)         /**< PORT signal: PORTDC2 on PA5 mux X1*/
#define PORT_PA5X1_PORT_PORTDC2                    (1UL << 5)
#define PIN_PA9X1_PORT_PORTDC3                     (9L)         /**< PORT signal: PORTDC3 on PA9 mux X1*/
#define PORT_PA9X1_PORT_PORTDC3                    (1UL << 9)
#define PIN_PA10X1_PORT_PORTDC4                    (10L)        /**< PORT signal: PORTDC4 on PA10 mux X1*/
#define PORT_PA10X1_PORT_PORTDC4                   (1UL << 10)
#define PIN_PA11X1_PORT_PORTDC5                    (11L)        /**< PORT signal: PORTDC5 on PA11 mux X1*/
#define PORT_PA11X1_PORT_PORTDC5                   (1UL << 11)
#define PIN_PA12X1_PORT_PORTDC6                    (12L)        /**< PORT signal: PORTDC6 on PA12 mux X1*/
#define PORT_PA12X1_PORT_PORTDC6                   (1UL << 12)
#define PIN_PA13X1_PORT_PORTDC7                    (13L)        /**< PORT signal: PORTDC7 on PA13 mux X1*/
#define PORT_PA13X1_PORT_PORTDC7                   (1UL << 13)
#define PIN_PA14X1_PORT_PORTDCEN1                  (14L)        /**< PORT signal: PORTDCEN1 on PA14 mux X1*/
#define PORT_PA14X1_PORT_PORTDCEN1                 (1UL << 14)
#define PIN_PA21X1_PORT_PORTDCEN2                  (21L)        /**< PORT signal: PORTDCEN2 on PA21 mux X1*/
#define PORT_PA21X1_PORT_PORTDCEN2                 (1UL << 21)
#define PIN_PA22X1_PORT_PORTDCCLK                  (22L)        /**< PORT signal: PORTDCCLK on PA22 mux X1*/
#define PORT_PA22X1_PORT_PORTDCCLK                 (1UL << 22)
/* ========== PIO definition for DEBUG peripheral ========== */
#define PIN_PB4X1_DEBUG_TDI                        (36L)        /**< DEBUG signal: TDI on PB4 mux X1*/
#define PORT_PB4X1_DEBUG_TDI                       (1UL << 4)
#define PIN_PB5X1_DEBUG_TDO                        (37L)        /**< DEBUG signal: TDO on PB5 mux X1*/
#define PORT_PB5X1_DEBUG_TDO                       (1UL << 5)
#define PIN_PB5X1_DEBUG_TRACESWO                   (37L)        /**< DEBUG signal: TRACESWO on PB5 mux X1*/
#define PORT_PB5X1_DEBUG_TRACESWO                  (1UL << 5)
#define PIN_PB6X1_DEBUG_TMS                        (38L)        /**< DEBUG signal: TMS on PB6 mux X1*/
#define PORT_PB6X1_DEBUG_TMS                       (1UL << 6)
#define PIN_PB6X1_DEBUG_SWDIO                      (38L)        /**< DEBUG signal: SWDIO on PB6 mux X1*/
#define PORT_PB6X1_DEBUG_SWDIO                     (1UL << 6)
#define PIN_PB7X1_DEBUG_TCK                        (39L)        /**< DEBUG signal: TCK on PB7 mux X1*/
#define PORT_PB7X1_DEBUG_TCK                       (1UL << 7)
#define PIN_PB7X1_DEBUG_SWDCLK                     (39L)        /**< DEBUG signal: SWDCLK on PB7 mux X1*/
#define PORT_PB7X1_DEBUG_SWDCLK                    (1UL << 7)
/* ========== PIO definition for FLASH peripheral ========== */
#define PIN_PB12X1_FLASH_ERASE                     (44L)        /**< FLASH signal: ERASE on PB12 mux X1*/
#define PORT_PB12X1_FLASH_ERASE                    (1UL << 12)
/* ========== PIO definition for TRACE peripheral ========== */
#define PIN_PD8D_TRACE_TRACECLK                    (104L)       /**< TRACE signal: TRACECLK on PD8 mux D*/
#define MUX_PD8D_TRACE_TRACECLK                    (3L)         /**< TRACE signal line function value: TRACECLK */
#define PORT_PD8D_TRACE_TRACECLK                   (1UL << 8)
#define PIN_PD4C_TRACE_TRACED0                     (100L)       /**< TRACE signal: TRACED0 on PD4 mux C*/
#define MUX_PD4C_TRACE_TRACED0                     (2L)         /**< TRACE signal line function value: TRACED0 */
#define PORT_PD4C_TRACE_TRACED0                    (1UL << 4)
#define PIN_PD5C_TRACE_TRACED1                     (101L)       /**< TRACE signal: TRACED1 on PD5 mux C*/
#define MUX_PD5C_TRACE_TRACED1                     (2L)         /**< TRACE signal line function value: TRACED1 */
#define PORT_PD5C_TRACE_TRACED1                    (1UL << 5)
#define PIN_PD6C_TRACE_TRACED2                     (102L)       /**< TRACE signal: TRACED2 on PD6 mux C*/
#define MUX_PD6C_TRACE_TRACED2                     (2L)         /**< TRACE signal line function value: TRACED2 */
#define PORT_PD6C_TRACE_TRACED2                    (1UL << 6)
#define PIN_PD7C_TRACE_TRACED3                     (103L)       /**< TRACE signal: TRACED3 on PD7 mux C*/
#define MUX_PD7C_TRACE_TRACED3                     (2L)         /**< TRACE signal line function value: TRACED3 */
#define PORT_PD7C_TRACE_TRACED3                    (1UL << 7)
/* ========== PIO definition for WKUP peripheral ========== */
#define PIN_PA0X1_WKUP_WKUP0                       (0L)         /**< WKUP signal: WKUP0 on PA0 mux X1*/
#define PORT_PA0X1_WKUP_WKUP0                      (1UL << 0)
#define PIN_PA1X1_WKUP_WKUP1                       (1L)         /**< WKUP signal: WKUP1 on PA1 mux X1*/
#define PORT_PA1X1_WKUP_WKUP1                      (1UL << 1)
#define PIN_PA2X1_WKUP_WKUP2                       (2L)         /**< WKUP signal: WKUP2 on PA2 mux X1*/
#define PORT_PA2X1_WKUP_WKUP2                      (1UL << 2)
#define PIN_PA4X1_WKUP_WKUP3                       (4L)         /**< WKUP signal: WKUP3 on PA4 mux X1*/
#define PORT_PA4X1_WKUP_WKUP3                      (1UL << 4)
#define PIN_PA5X1_WKUP_WKUP4                       (5L)         /**< WKUP signal: WKUP4 on PA5 mux X1*/
#define PORT_PA5X1_WKUP_WKUP4                      (1UL << 5)
#define PIN_PD28X1_WKUP_WKUP5                      (124L)       /**< WKUP signal: WKUP5 on PD28 mux X1*/
#define PORT_PD28X1_WKUP_WKUP5                     (1UL << 28)
#define PIN_PA9X1_WKUP_WKUP6                       (9L)         /**< WKUP signal: WKUP6 on PA9 mux X1*/
#define PORT_PA9X1_WKUP_WKUP6                      (1UL << 9)
#define PIN_PA11X1_WKUP_WKUP7                      (11L)        /**< WKUP signal: WKUP7 on PA11 mux X1*/
#define PORT_PA11X1_WKUP_WKUP7                     (1UL << 11)
#define PIN_PA14X1_WKUP_WKUP8                      (14L)        /**< WKUP signal: WKUP8 on PA14 mux X1*/
#define PORT_PA14X1_WKUP_WKUP8                     (1UL << 14)
#define PIN_PA19X1_WKUP_WKUP9                      (19L)        /**< WKUP signal: WKUP9 on PA19 mux X1*/
#define PORT_PA19X1_WKUP_WKUP9                     (1UL << 19)
#define PIN_PA20X1_WKUP_WKUP10                     (20L)        /**< WKUP signal: WKUP10 on PA20 mux X1*/
#define PORT_PA20X1_WKUP_WKUP10                    (1UL << 20)
#define PIN_PA30X1_WKUP_WKUP11                     (30L)        /**< WKUP signal: WKUP11 on PA30 mux X1*/
#define PORT_PA30X1_WKUP_WKUP11                    (1UL << 30)
#define PIN_PB3X1_WKUP_WKUP12                      (35L)        /**< WKUP signal: WKUP12 on PB3 mux X1*/
#define PORT_PB3X1_WKUP_WKUP12                     (1UL << 3)
#define PIN_PB5X1_WKUP_WKUP13                      (37L)        /**< WKUP signal: WKUP13 on PB5 mux X1*/
#define PORT_PB5X1_WKUP_WKUP13                     (1UL << 5)

#endif /* _PIC32CZ1038CA70100_GPIO_H_ */
